Revit 2024 API
ViewSchedule.IsSplit Method
 Checks if the schedule is split.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022.1
Syntax
C#
public bool IsSplit()
Visual Basic
Public Function IsSplit As Boolean
Visual C++
public:
bool IsSplit()
Return Value
 True if the schedule is split. Otherwise false.
See Also
ViewSchedule Class
Autodesk.Revit.DB Namespace